# -------------------------------------------------------------------------------------------------------------------------------------------------
# LIST COMPREHENSION
# -------------------------------------------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 1: List Comprehension yapısı kullanarak car_crashes verisindeki numeric değişkenlerin isimlerini büyük
# harfe çeviriniz ve başına NUM ekleyiniz. Numeric olmayan değişkenlerin de isimleri büyümeli.
# Tek bir list comprehension yapısı kullanılmalı.
# ---------------------------------------------------------------------------------------------------------------------------------------------------

import seaborn as sns                   # seaborn kütüphanesinin takma adı
df = sns.load_dataset("car_crashes")    # seaborn'un içinde hazır gelen örnek car_crashes veri setini yükler.
df.columns                              # Bunu Pandas dataframe olarak bize verir.
df.head()


df.columns = ["NUM_"+ col.upper() if df[col].dtype != "O" else col.upper() for col in df.columns]
df.columns

"""
--------------------------------------
Beklenen Çıktı:
--------------------------------------
["NUM_TOTAL",
"NUM_SPEEDING",
"NUM_ALCOHOL",
"NUM_NOT_DISTRACTED",
"NUM_NO_PREVIOUS",
"NUM_INS_PREMIUM",
"NUM_INS_LOSSES",
"ABBREV" ]
"""

# -------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 2: List Comprehension yapısı kullanarak car_crashes verisinde isminde "NO" barındırmayan
# değişkenlerin isimlerinin sonuna "FLAG" yazınız.
# -------------------------------------------------------------------------------------------------------------------------------------------------
df.columns = [col+"_FLAG" if "NO" not in col else col for col in df.columns]
df.columns

"""
Beklenen Çıktı
------------------
["TOTAL_FLAG",
"SPEEDING_FLAG",
"ALCOHOL_FLAG",
"NOT_DISTRACTED",
"NO_PREVIOUS",
"INS_PREMIUM_FLAG",
"INS_LOSSES_FLAG",
"ABBREV_FLAG" ]

Tüm değişkenlerin isimleri büyük harf olmalı.
Tek bir list comprehension yapısı ile yapılmalı.
"""

# -------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 3: List Comprehension yapısı kullanarak aşağıda verilen değişken isimlerinden FARKLI olan
# değişkenlerin isimlerini seçiniz ve yeni bir dataframe oluşturunuz.
# -------------------------------------------------------------------------------------------------------------------------------------------------

og_list = ["abbrev","no_previous"]
new_df = df[[col for col in df.columns if col not in og_list]]   # içerde tuttuğumuz liste onu df'in kolonları listesi şeklinde kullandık
new_df.head()

"""
----------------------------------
Beklenen Çıktı
-----------------------------------
total            speeding             alcohol                  not_distracted           ins_premium               ins_losses
18.800            7.332                5.640                    18.048                     784.550                  145.080
18.100            7.421                4.525                    16.290                     1053.480                 133.930
.
.
.

Önce verilen listeye göre list comprehension kullnarak new_cols adında yeni liste oluşturunuz.
Sonra df[new_cols] ile bu değişkenleri seçerek yeni bir df oluşturunuz ve adını new_df olarak isimlendiriniz.
"""

#--------------------------------------------------------------------------------------------------------------------------------------------------
# PANDAS ALIŞTIRMALAR
#-------------------------------------------------------------------------------------------------------------------------------------------------
#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 1: Seaborn kütüphanesi içerisinden Titanic veri setini tanımlayınız.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df = sns.load_dataset("titanic")
df.head()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 2: Titanic veri setindeki kadın ve erkek yolcuların sayısını bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df["sex"].value_counts()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 3: Her bir sutuna ait unique değerlerin sayısını bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

for col in df.columns:
    print(col,df[col].unique())

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 4: pclass değişkeninin unique değerlerinin sayısını bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df.head()
df["pclass"].unique()
df["pclass"].nunique()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 5: pclass ve parch değişkenlerinin unique değerlerinin sayısını bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df[["pclass","parch"]].nunique()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 6: embarked değişkeninin tipini kontrol ediniz. Tipini category olarak değiştiriniz ve tekrar kontrol ediniz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df["embarked"].dtype

df["embarked"] = df["embarked"].astype("category")
df["embarked"].dtype


#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 7: embarked değeri C olanların tüm bilgelerini gösteriniz.
#--------------------------------------------------------------------------------------------------------------------------------------------------


df[df["embarked"]=="C"]

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 8: embarked değeri S olmayanların tüm bilgelerini gösteriniz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df[df["embarked"] != "S"]

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 9: Yaşı 30 dan küçük ve kadın olan yolcuların tüm bilgilerini gösteriniz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df[(df["age"]<30) & (df["sex"] == "female")]

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 10: Fare'i 500'den büyük veya yaşı 70 den büyük yolcuların bilgilerini gösteriniz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df.head()
df.columns

df[(df["fare"]>500) | (df["age"]>70)]

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 11: Her bir değişkendeki boş değerlerin toplamını bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df.isnull().sum()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 12: who değişkenini dataframe’den çıkarınız.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df = df.drop("who",axis = 1)
df.columns

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 13: deck değikenindeki boş değerleri deck değişkenin en çok tekrar eden değeri (mode) ile doldurunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df["deck"].isnull().sum()
df["deck"] = df["deck"].fillna(df["deck"].mode()[0])   # mode serisi içindeki ilk eleman ile null değerleri dolduruyoruz categoric değişkende
df["deck"].isnull().sum()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 14: age değikenindeki boş değerleri age değişkenin medyanı ile doldurunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df["age"].isnull().sum()
df["age"] = df["age"].fillna(df["age"].median())
df["age"].isnull().sum()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 15: survived değişkeninin pclass ve cinsiyet değişkenleri kırılımınında sum, count, mean değerlerini bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df.groupby(["pclass","sex"])["survived"].agg(["sum","count","mean"])

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 16: 30 yaşın altında olanlar 1, 30'a eşit ve üstünde olanlara 0 vericek bir fonksiyon yazın. Yazdığınız fonksiyonu kullanarak
# titanik veri setinde age_flag adında bir değişken oluşturunuz oluşturunuz. (apply ve lambda yapılarını kullanınız)
#--------------------------------------------------------------------------------------------------------------------------------------------------

def age_flag(x):
    if x < 30:
        return 1
    else:
        return 0


df["age_flag"] = df["age"].apply(age_flag)
df.head()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 17: Seaborn kütüphanesi içerisinden Tips veri setini tanımlayınız.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df = sns.load_dataset("Tips")
df.head()


#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 18: Time değişkeninin kategorilerine (Dinner, Lunch) göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df["time"].unique()
df["time"].value_counts()

df.groupby("time")["total_bill"].agg(["min","max","sum"])

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 19: Günlere ve time göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

# df.groupby("grup_değişkeni")["hesaplanacak_değişken"].agg(fonksiyonlar)

df.groupby(["day","time"])["total_bill"].agg(["min","max","sum","mean"])
df.columns
df.head()
#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 20: Lunch zamanına ve kadın müşterilere ait total_bill ve tip değerlerinin day'e göre toplamını, min, max ve ortalamasını bulunuz.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df["time"].unique()
df["sex"].unique()


df[(df["time"] == "Lunch") & (df["sex"] == "Female")]\
    .groupby("day")\
    .agg({"total_bill" : ["min","max","mean","sum"],
          "tip" : ["min","max","mean","sum"]})


#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 21: size'i 3'ten küçük, total_bill'i 10'dan büyük olan siparişlerin ortalaması nedir? (loc kullanınız)
#--------------------------------------------------------------------------------------------------------------------------------------------------


df.loc[(df["size"] < 3) & (df["total_bill"] > 10),'total_bill'].mean()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 22: total_bill_tip_sum adında yeni bir değişken oluşturunuz. Her bir müşterinin ödediği totalbill ve tip in toplamını versin.
#--------------------------------------------------------------------------------------------------------------------------------------------------

df["total_bill_tip_sum"] = df["total_bill"] + df["tip"]
df.head()

#--------------------------------------------------------------------------------------------------------------------------------------------------
# Görev 23: total_bill_tip_sum değişkenine göre büyükten küçüğe sıralayınız ve ilk 30 kişiyi yeni bir dataframe'e atayınız.
#--------------------------------------------------------------------------------------------------------------------------------------------------

new_df2 = df.sort_values("total_bill_tip_sum", ascending=False).head(30)
new_df2.shape
